# Оцінка асимптотичної складності функції f(n), найгірший випадок (О -"велике")

def f(n):
    sum = 0
    for i in range(1, n + 1):
        sum = sum + i
    return sum

# результат виконання (натуральне число n)
# оптимізувати можна, покращивши її асимптотичну оцінку?

# пояснення:
# ця функція виконує n ітерацій у циклі for
# на кожній ітерації вона додає число i до змінної sum (операція O(1))
# таким чином, складність циклу дорівнює O(n)
# висновок: функція f(n) має асимптотичну оцінку O(n)

# оптимізація функції f(n):
# операцію суми чисел від 1 до n можна замінити формулою арифметичної прогресії:
# сума чисел: S = n * (n + 1) // 2, яка обчислюється за O(1)

def optimized_f(n):
    return n * (n + 1) // 2

# результат - сума перших n натуральних чисел