# Рекурсія. Повний перебір.
# 10.4. Перестановки n по k (100%)
# Вказівка 1. В завданнях забороняється використовувати сторонні бібліотеки перебору, наприклад, itertoools.
# Вказівка 2. У кожному завданні має бути реалізований та використаний алгоритм повного перебору, навіть якщо існує оптимальніший підхід.


def generate_permutations(n, k):
    result = []  # масив для збереження поточної перестановки
    used = [False] * (n + 1)  # масив для відстеження використаних чисел
    # створює список булевих значень (True/False) довжиною n + 1, де всі елементи спочатку мають значення False
    # додаємо +1, щоб зручно використовувати індексацію від 1 до n, не використовуючи 0-й елемент (оскільки номери чисел у задачі починаються з 1)
    
    def backtrack():
        if len(result) == k:  
            print(" ".join(map(str, result)))  # у вигляді рядка
            return  # повертаюся до попереднього кроку
        
        for i in range(1, n + 1):  
            if not used[i]:  
                used[i] = True  # використане
                result.append(i)  
                backtrack()  # рекурсивно викликаю функцію для наступного числа
                result.pop()  # видаляю останнє число для повернення до попереднього стану
                used[i] = False  # невикористане для наступних ітерацій
    
    backtrack()  # запуск рекурсії для генерації всіх перестановок

n, k = map(int, input().split())
generate_permutations(n, k)  