# Перевірка орфографії
# використання хеш-таблиці (set)

import sys
import re
# використовується для роботи з регулярними виразами

data = sys.stdin.read().split("\n")

# зчитуємо перший рядок з N та M
N, M = map(int, data[0].split())

# зчитуємо словник (переводимо слова у нижній регістр)
dictionary = {data[i].strip().lower() for i in range(1, N + 1)}
# формуємо множину dictionary зі слів словника, переводячи їх у нижній регістр (lower())

found_words = set()

# регулярний вираз для виділення слів (рядкові та великі латинські літери)
word_pattern = re.compile(r"[a-zA-Z]+")
'''
r"...": позначає, що рядок є сирим рядком (raw string). У сирому рядку символи екранування (наприклад, \) не мають спеціального значення, тому їх не потрібно подвоювати, як це робиться в звичайних рядках.

[a-zA-Z]: клас символів, який визначає, що ми шукаємо будь-яку букву англійського алфавіту.
a-z — будь-яка мала літера.
A-Z — будь-яка велика літера.

+: означає, що символи, визначені в попередньому класі (тобто букви), можуть повторюватися один або більше разів. Тобто буде знайдено слово з будь-якою кількістю літер.
'''

# обробляємо текст твору, додаючи слова до множини
for i in range(N + 1, N + 1 + M):
    for word in word_pattern.findall(data[i]):
        # метод findall() повертає список усіх підрядків, що відповідають заданому патерну
        # findall() у модулі re (regular expressions) використовується для пошуку всіх збігів заданого регулярного виразу в рядку. 
        # Він повертає список усіх знайдених відповідностей.
        found_words.add(word.lower())  

if found_words == dictionary:
    print("Everything is going to be OK.")
elif not found_words.issubset(dictionary):
    # метод issubset() використовується для перевірки того, чи є одна множина підмножиною іншої
    print("Some words from the text are unknown.")
else:
    print("The usage of the vocabulary is not perfect.")