# Бінарний пошук по відповіді.

def min_drying_time(n, a, k):
    
    """
    функція обчислює min час сушіння одягу
    
    n: к-сть речей (ціле число)
    a: список з к-стю води в кожній речі 
    k: швидкість сушіння на батареї 
    return: min час, необхідний для сушіння всіх речей 
    """
    
    # сортую речі за спаданням к-сті води для ефективного сушіння
    # оскільки радіатор може одночасно сушити лише одну річ і він видаляє k одиниць води за хвилину, 
    # вигідно спочатку сушити ті речі, які містять найбільше води
    a.sort(reverse=True)

    
    # min час, необхідний для сушіння
    left, right = 0, a[0]
    
    # бінарний пошук за відповіддю
    while left < right:
        mid = (left + right) // 2  # кандидат на відповідь (тільки на цьому моменті написання коду)
        
        # спроба імітувати процес сушіння
        extra_minutes = 0
        for i in range(n):
            if a[i] - mid > 0:
                if k == 1:
                    extra_minutes = float('inf')  # неможливо висушити швидше
                    break
                extra_minutes += (a[i] - mid + (k - 2)) // (k - 1)
        
        if extra_minutes <= mid:
            right = mid  # пробую менший час
        else:
            left = mid + 1  # продовжую пошук у більший бік
    
    return left

n = int(input())
a = list(map(int, input().split()))
k = int(input())

print(min_drying_time(n, a, k))