def can_transport(k, X, B):

    """перевіряє, чи можна перевезти k вантажівок, вибираючи медіану!! для кожного блоку"""
    
    n = len(X)
    # n — к-сть рисових полів, що дорівнює довжині списку X (відсортованого за координатами)
    
    # для обчислення витрат
    prefix_sum = [0] * (n + 1)
    # масив prefix_sum довжиною n + 1
    # для кожного індексу i + координату X[i] до попередньої суми, щоб у prefix_sum[i + 1] містилась сума всіх координат від X[0] до X[i]
    # prefix_sum використовується для ефективного обчислення сум елем на підмасивах. 
    # Це допомагає значно зменшити час виконання програми, якщо треба часто знаходити суму елементів на різних відрізках списку
    # Без використання префіксних сум я б кожного разу проходила по відрізку масиву для обчислення його суми, 
    # що призводить до багаторазового повторення однакових операцій. Це збільшує час виконання, особливо коли масив великий
    for i in range(n):
        prefix_sum[i + 1] = prefix_sum[i] + X[i]
    
    # перевірка кожного можливого блоку з k рисових полів
    min_cost = float('inf')
    # це значення буде використовуватись для збереження мінімальних витрат на транспортування для різних блоків рисових полів
    
    for i in range(n - k + 1):
        # медіанна - точка для поточного блоку (середина блоку)
        # цикл перебирає всі можливі блоки розміром k елементів в списку X. 
        # Для кожного i перевіряється блок, що починається з індексу i і включає k елементів
        median = X[i + k // 2]
        
        # витрати для цього блоку
        left_sum = median * (k // 2) - (prefix_sum[i + k // 2] - prefix_sum[i])
        # для кожного поля ліворуч від медіани витрати обчислюються як різниця між координатою медіани і координатою поля
        right_sum = (prefix_sum[i + k] - prefix_sum[i + k // 2]) - median * (k - k // 2)
        
        total_cost = left_sum + right_sum
        # total_cost — це сумарні витрати на транспортування для даного блоку з k елементів
        
        min_cost = min(min_cost, total_cost)
        # oновлюємо мінімальні витрати, якщо поточний блок дає менші витрати
    
    # повертаю, чи можна перевезти k вантажівок без перевищення бюджету
    return min_cost <= B

def max_rice_trucks(R, L, B, X):

    """повертає максимальну к-сть вантажівок, які можна перевезти не перевищуючи бюджет"""
    
    left, right = 0, R
    best = 0
    # best — змінна для збереження максимального значення кількості вантажівок, які можна перевезти, не перевищуючи бюджет

    # бінарний пошук по к-сті вантажівок
    while left <= right:
        mid = (left + right) // 2
        if can_transport(mid, X, B):
            best = mid  # можна перевезти mid вантажівок
            left = mid + 1  # спробують перевезти більше
        else:
            right = mid - 1  # менше
    
    return best

R, L, B = map(int, input().split())
X = [int(input()) for _ in range(R)]

result = max_rice_trucks(R, L, B, X)

print(result)